In [23]:
import pandas as pd
import numpy as np

df1 = df = pd.DataFrame(np.random.randint(0,30,size=(4, 4)), columns=list('ABCD'))
df2 = df = pd.DataFrame(np.random.randint(0,50,size=(4, 4)), columns=list('ABCD'))

print (df1)
print ('\n')
print (df2)

    A   B   C   D
0  11  20  20  19
1   5  14   0   2
2  13  15  29   4
3   9  12  15  20


    A   B   C   D
0  40  43  11   4
1  17  28   3   7
2  21  23   4  11
3  24  13  21  41

# **Importar datos**

In [69]:
#Se puede importar datos desde variostipos de archivo. Para ello se utilizar read_<extencion del archivo> ('direccion')
#Nota: el archivo puede estar alojado de forma local o remota.  
df = pd.read_csv("https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv")

print(df)

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]

# **Limpieza de datos**

In [109]:
#Se puede verificar si faltan valores de datos mediante .isnull()
df3.isnull()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False  False

In [110]:
#Se puede obtener una suma de valores faltantes con .sum()
df3.isnull().sum()

A    0
B    0
C    0
dtype: int64

In [111]:
#Para eliminar columnas donde hay datos perdidos se utilizar .dropna()
df3.dropna()

    A   B   C
0  23  18  54
1  12  20  14
2  30  22  36

In [113]:
#Para eliminar filas donde hay datos perdidos se utilizar .dropna(axis=1)
df3.dropna(axis=1)

    A   B   C
0  23  18  54
1  12  20  14
2  30  22  36

In [116]:
#Tambien se puede rellenar los valores nulos de un data frame con .fillna(<valor o variable a utilziar>)
df3.fillna(1)

    A   B   C
0  23  18  54
1  12  20  14
2  30  22  36

In [117]:
#Tambien se puede rellenar los valores nulos de un data frame con la media de los datos totales
df3.fillna(df3.mean())

    A   B   C
0  23  18  54
1  12  20  14
2  30  22  36

# **Operaciones Algebraicas**

In [ ]:
#suma los dos dataframes, elemento por elemento
pd.DataFrame.add(df1,df2)

    A   B   C   D
0  50  27  66  41
1  53  14  32  35
2  45  28   4  71
3  47  43  19  40
4   5  41  56  18
5  31  47  59  58
6  50  13  48  20

In [ ]:
#resta a un dataframe otro dataframe, elemento por elemento
pd.DataFrame.sub(df1,df2)

    A   B   C   D
0 -34 -13 -12 -27
1 -39  -6 -12 -17
2 -37   2   0 -19
3 -39 -33  15 -20
4   3 -27 -10  -6
5 -19 -17  -5 -38
6 -36  -7 -18   4

In [ ]:
#multiplica un dataframe por otro, elemento por elemento
pd.DataFrame.mul(df1,df2)

     A    B     C     D
0  336  140  1053   238
1  322   40   220   234
2  164  195     4  1170
3  172  190    34   300
4    4  238   759    72
5  150  480   864   480
6  301   30   495    96

In [ ]:
#divide un dataframe por otro, elemento por elemento
pd.DataFrame.div(df1,df2)

          A         B         C         D
0  0.190476  0.350000  0.692308  0.205882
1  0.152174  0.400000  0.454545  0.346154
2  0.097561  1.153846  1.000000  0.577778
3  0.093023  0.131579  8.500000  0.333333
4  4.000000  0.205882  0.696970  0.500000
5  0.240000  0.468750  0.843750  0.208333
6  0.162791  0.300000  0.454545  1.500000

In [ ]:
#devuelve el resultado de calcular el módulo de un dataframe y otro dataframe, elemento por elemento
df2.mod(df1)

   A   B   C   D
0  2   6  12   6
1  4   2   2   8
2  1  13   0  19
3  3   3   2   0
4  1   6  10   0
5  1   2   5   8
6  1   1   3   8

In [ ]:
#devuelve el resultado de calcular el módulo de un dataframe y otro dataframe, elemento por elemento
df1.dot([2,2,2,2])

0     60
1    102
2    102
3     46
dtype: int64

In [ ]:
#devuelve una copia del dataframe conteniendo el valor absoluto de cada uno de sus valores
pd.DataFrame.abs(df1*(-2))

    A   B   C   D
0  10   2  22  26
1  12  46  18  26
2  10  22  58  12
3   6  14  16  10

# **Conocer un dataFrame**

In [ ]:
#Para conocer la estrucutra de un data frame se utiliza .shape
df1.shape

In [ ]:
#Se puede extraer la cantidad de filas o columnas de un dataframe
print(len(df1.columns))
print(len(df1.index))

# **Manejo de estructuras**

In [43]:
#Se puede seleccionar una columna mediante indexacion
df1['A']

0    11
1     5
2    13
3     9
Name: A, dtype: int64

In [47]:
#Se pueden seleccionar varias columnas de manera similar usando un otro par de []
df1[['A','C']]

    A   C
0  11  20
1   5   0
2  13  29
3   9  15

In [ ]:
#Extraer el valor de un elemento de un DataFrame
#Nota: la indexación se realiza mediante [columna][fila]
df1['A'][1]

19

In [ ]:
#Tabien es posible utilizando indexacion mediante .iloc
#Nota: indexacion mediante [fila, columna]
df1.iloc[0,1]

23

In [ ]:
#Otra forma de indexar es mediante .loc
#La diferencia con .iloc es que .loc admite etiquetas en su endexacion
#Nota: indexacion mediante [fila, columna]
df1.loc[0,'A']

14

In [53]:
#Se puede utilizar .iloc con dos puntos para seleccionar desde o hasta una fila
df1.iloc[1:3]

    A   B   C  D
1   5  14   0  2
2  13  15  29  4

# Estadisticas básicas

In [26]:
#Se puede obtener estadísticas descriptivas como media, meadiana, máx, mín, std y conteos para una columna en particular de los datos
#mediante la funcion .describe()
df1.describe()

              A         B          C          D
count   4.00000   4.00000   4.000000   4.000000
mean    9.50000  15.25000  16.000000  11.250000
std     3.41565   3.40343  12.138094   9.569918
min     5.00000  12.00000   0.000000   2.000000
25%     8.00000  13.50000  11.250000   3.500000
50%    10.00000  14.50000  17.500000  11.500000
75%    11.50000  16.25000  22.250000  19.250000
max    13.00000  20.00000  29.000000  20.000000

In [35]:
#Se puede saber el numero de valores no nulos en el drata frame con .count()
df1.count()

A    4
B    4
C    4
D    4
dtype: int64

In [28]:
#Se puede saber la media de todas las columnas utilizando mean()
df1.mean()

A     9.50
B    15.25
C    16.00
D    11.25
dtype: float64

In [32]:
#Para conecer la correlaccion entre dos columnas se utiliza .corr
df1['A'].corr(df1['A'])

1.0

In [36]:
#Para conocer el valor maximo de cada columna se utiliza .max()
df1.max()

A    13
B    20
C    29
D    20
dtype: int64

In [37]:
#Para conocer el valor maximo de una columna basta con indexar y utilizar .max()
df1['A'].max()

13

In [39]:
#De igual forma se utiliza .min() 
df1.min()

A     5
B    12
C     0
D     2
dtype: int64

In [40]:
##
df1['A'].min()

5

In [41]:
#Se puede conocer la mediana de cada columna con .median(), y tambien de una columna indexandola.
df1.median()

A    10.0
B    14.5
C    17.5
D    11.5
dtype: float64

In [42]:
#Tambien se puede conocer la desviacion estandar del data frame con .std()
df1.std()

A     3.415650
B     3.403430
C    12.138094
D     9.569918
dtype: float64